IlleniumDillon/MM32F5277/PinMap/MM32_UART_PinMap.h
#ifndef _MM32_UART_PINMAP_H_
#define _MM32_UART_PINMAP_H_

#include <MM32_PinMapType.h>

typedef MM32_GPIO_AFPin MM32_UART_Pin;

extern MM32_UART_Pin UART1_TX_PA9;
extern MM32_UART_Pin UART1_RX_PA10;
extern MM32_UART_Pin UART1_CTS_PA11;
extern MM32_UART_Pin UART1_RTS_PA1;
extern MM32_UART_Pin UART1_TX_PB6;
extern MM32_UART_Pin UART1_RX_PB7;
extern MM32_UART_Pin UART1_CTS_PB8;
extern MM32_UART_Pin UART1_RTS_PB9;
extern MM32_UART_Pin UART1_TX_PC4;
extern MM32_UART_Pin UART1_RX_PC5;

extern MM32_UART_Pin UART2_CTS_PA0;
extern MM32_UART_Pin UART2_RTS_PA1;
extern MM32_UART_Pin UART2_TX_PA2;
extern MM32_UART_Pin UART2_RX_PA3;
extern MM32_UART_Pin UART2_CTS_PD3;
extern MM32_UART_Pin UART2_RTS_PD4;
extern MM32_UART_Pin UART2_TX_PD5;
extern MM32_UART_Pin UART2_RX_PD6;

extern MM32_UART_Pin UART3_TX_PB10;
extern MM32_UART_Pin UART3_RX_PB11;
extern MM32_UART_Pin UART3_CTS_PB13;
extern MM32_UART_Pin UART3_RTS_PB14;
extern MM32_UART_Pin UART3_TX_PC10;
extern MM32_UART_Pin UART3_RX_PC11;
extern MM32_UART_Pin UART3_TX_PD8;
extern MM32_UART_Pin UART3_RX_PD9;
extern MM32_UART_Pin UART3_CTS_PD11;
extern MM32_UART_Pin UART3_RTS_PD12;

extern MM32_UART_Pin UART4_TX_PA0;
extern MM32_UART_Pin UART4_RX_PA1;
extern MM32_UART_Pin UART4_CTS_PA14;
extern MM32_UART_Pin UART4_RTS_PA15;
extern MM32_UART_Pin UART4_TX_PC0;
extern MM32_UART_Pin UART4_RX_PC1;
extern MM32_UART_Pin UART4_CTS_PC2;
extern MM32_UART_Pin UART4_RTS_PC3;
extern MM32_UART_Pin UART4_TX_PC10;
extern MM32_UART_Pin UART4_RX_PC11;

extern MM32_UART_Pin UART5_TX_PA4;
extern MM32_UART_Pin UART5_RX_PA5;
extern MM32_UART_Pin UART5_CTS_PB3;
extern MM32_UART_Pin UART5_RTS_PB4;
extern MM32_UART_Pin UART5_TX_PC12;
extern MM32_UART_Pin UART5_RX_PD2;

extern MM32_UART_Pin UART6_TX_PB0;
extern MM32_UART_Pin UART6_RX_PB1;
extern MM32_UART_Pin UART6_TX_PC6;
extern MM32_UART_Pin UART6_RX_PC7;
extern MM32_UART_Pin UART6_RTS_PG8;
extern MM32_UART_Pin UART6_RX_PG9;
extern MM32_UART_Pin UART6_RTS_PG12;
extern MM32_UART_Pin UART6_CTS_PG13;
extern MM32_UART_Pin UART6_TX_PG14;
extern MM32_UART_Pin UART6_CTS_PG15;

extern MM32_UART_Pin UART7_TX_PB6;
extern MM32_UART_Pin UART7_RX_PB7;
extern MM32_UART_Pin UART7_RX_PE7;
extern MM32_UART_Pin UART7_TX_PE8;
extern MM32_UART_Pin UART7_RX_PF6;
extern MM32_UART_Pin UART7_TX_PF7;

#endif